var responseData={
		"numFound" : 6,
		"start" : 0,
		"botResponse":{
			'code':10000,
			'text':"如果用一句话去理解，就是友云采可以帮助企业实现：1、C类物资也可以集中采购了  2、B类物资不需要备货了 3、A类物资不会掉链子了。\r\n友云采是企业互联网采购服务平台，旨在帮助企业做最佳采购决策和高效协同。友云采提供云采超市、工业品超市、供应商门户协同三个交易场景服务，为办公用品、MRO工业品、BOM原材料不同品类采购提供一站式服务，同时提供采购搜索、采购寻源、招投标、实时竞价、供应商推荐引擎、供应商关系管理服务，帮助企业采购更高效、更透明，获得更低的采购成本和更高的采购质量。友云采打通平台交易与ERP内部采购流程，连接了十几家2B电商交易平台，通过互联网微服务架构，及大数据（物料与商业智能匹配）、机器学习（物料与商品智能）技术的使用，让2B长流程采购决策与执行更简单，从交易过程到采购执行管理全流程数字化、在线化。"
		},
		"docs" : [{
			"createTime" : "2015-05-12 10:27:02.0",
			"author" : "边传猛",
			"updateTime" : "2015-10-12 10:34:19.0",
			"id" : 1,
			"title" : "元数据管理工具功能简介",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"descriptImg" : "https://ss0.baidu.com/73F1bjeh1BF3odCf/it/u=1131968136,69861094&fm=85&s=33578A7E1E76C5DC54972FA80200B00A",
			"url" : "http://udn.yyuap.com/doc/ae/1507337.html",
			"_version_" : 1567172666768490496
		}, {
			"createTime" : "2017-05-12 10:27:02.0",
			"updateTime" : "2017-05-12 10:34:19.0",
			"id" : 2,
			"title" : "emm_portal单点登录模块应用",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=30791",
			"_version_" : 1567172666820919296
		}, {
			"createTime" : "2017-05-12 10:34:19.0",
			"author" : "段丽霞",
			"updateTime" : "2017-05-12 10:34:19.0",
			"id" : 3,
			"title" : "数据处理平台产品API文档",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"url" : "http://udn.yyuap.com/doc/ae/920513.html",
			"_version_" : 1567172666823016448
		}, {
			"createTime" : "2017-05-12 11:15:51.0",
			"updateTime" : "2017-05-12 11:15:51.0",
			"id" : 4,
			"title" : "高稳定性高并发全平台社交聊天IM对外合作支持源码",
			"descript" : "成熟的消息收发确认机制，支持万人大群\n\n支持开发自定义的消息sdk接口，扩展性超强\n\n支持单/群聊，支持红包/文件等功能模块 支持朋友圈分享等功能\n\n同步增加商城/H5应用/附近的人/等模块化功能",
			"descriptImg" : "https://ss0.baidu.com/73F1bjeh1BF3odCf/it/u=1131968136,69861094&fm=85&s=33578A7E1E76C5DC54972FA80200B00A",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=146729",
			"_version_" : 1567172666827210752
		}, {
			"createTime" : "2017-05-12 11:17:47.0",
			"updateTime" : "2017-05-12 11:17:47.0",
			"id" : 5,
			"title" : "iUAP Mobile 移动开发工具（稳定版v2.5.1）下载",
			"descript" : "此文件较大，约688M，请使用web端下载，谢谢",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=33279",
			"_version_" : 1567172666830356480
		}, {
			"createTime" : "2017-05-12 11:38:27.0",
			"updateTime" : "2017-05-12 11:38:27.0",
			"id" : 6,
			"title" : "DI常见问题",
			"descript" : "1.1.     作业 调度： 如何并行 执行 ？1.2.     表输出：如何 自动创建表 ？1.3.     作业 调度 ：如何 设置转换无效 ？",
			"url" : "http://udn.yyuap.com/doc/ae/919180.html",
			"_version_" : 1567172666832453632
		},{
			"createTime" : "2015-05-12 10:27:02.0",
			"author" : "边传猛",
			"updateTime" : "2015-10-12 10:34:19.0",
			"id" : 7,
			"title" : "元数据管理工具功能简介",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"descriptImg" : "https://ss0.baidu.com/73F1bjeh1BF3odCf/it/u=1131968136,69861094&fm=85&s=33578A7E1E76C5DC54972FA80200B00A",
			"url" : "http://udn.yyuap.com/doc/ae/1507337.html",
			"_version_" : 1567172666768490496
		}, {
			"createTime" : "2017-05-12 10:27:02.0",
			"updateTime" : "2017-05-12 10:34:19.0",
			"id" : 8,
			"title" : "emm_portal单点登录模块应用",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=30791",
			"_version_" : 1567172666820919296
		}, {
			"createTime" : "2017-05-12 10:34:19.0",
			"author" : "段丽霞",
			"updateTime" : "2017-05-12 10:34:19.0",
			"id" : 9,
			"title" : "数据处理平台产品API文档",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"url" : "http://udn.yyuap.com/doc/ae/920513.html",
			"_version_" : 1567172666823016448
		}, {
			"createTime" : "2017-05-12 11:15:51.0",
			"updateTime" : "2017-05-12 11:15:51.0",
			"id" : 10,
			"title" : "高稳定性高并发全平台社交聊天IM对外合作支持源码",
			"descript" : "成熟的消息收发确认机制，支持万人大群\n\n支持开发自定义的消息sdk接口，扩展性超强\n\n支持单/群聊，支持红包/文件等功能模块 支持朋友圈分享等功能\n\n同步增加商城/H5应用/附近的人/等模块化功能",
			"descriptImg" : "https://ss0.baidu.com/73F1bjeh1BF3odCf/it/u=1131968136,69861094&fm=85&s=33578A7E1E76C5DC54972FA80200B00A",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=146729",
			"_version_" : 1567172666827210752
		}, {
			"createTime" : "2017-05-12 11:17:47.0",
			"updateTime" : "2017-05-12 11:17:47.0",
			"id" : 11,
			"title" : "iUAP Mobile 移动开发工具（稳定版v2.5.1）下载",
			"descript" : "此文件较大，约688M，请使用web端下载，谢谢",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=33279",
			"_version_" : 1567172666830356480
		}, {
			"createTime" : "2017-05-12 11:38:27.0",
			"updateTime" : "2017-05-12 11:38:27.0",
			"id" : 12,
			"title" : "DI常见问题",
			"descript" : "1.1.     作业 调度： 如何并行 执行 ？1.2.     表输出：如何 自动创建表 ？1.3.     作业 调度 ：如何 设置转换无效 ？",
			"url" : "http://udn.yyuap.com/doc/ae/919180.html",
			"_version_" : 1567172666832453632
		},{
			"createTime" : "2015-05-12 10:27:02.0",
			"author" : "边传猛",
			"updateTime" : "2015-10-12 10:34:19.0",
			"id" : 13,
			"title" : "元数据管理工具功能简介",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"descriptImg" : "https://ss0.baidu.com/73F1bjeh1BF3odCf/it/u=1131968136,69861094&fm=85&s=33578A7E1E76C5DC54972FA80200B00A",
			"url" : "http://udn.yyuap.com/doc/ae/1507337.html",
			"_version_" : 1567172666768490496
		}, {
			"createTime" : "2017-05-12 10:27:02.0",
			"updateTime" : "2017-05-12 10:34:19.0",
			"id" : 14,
			"title" : "emm_portal单点登录模块应用",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=30791",
			"_version_" : 1567172666820919296
		}, {
			"createTime" : "2017-05-12 10:34:19.0",
			"author" : "段丽霞",
			"updateTime" : "2017-05-12 10:34:19.0",
			"id" : 15,
			"title" : "数据处理平台产品API文档",
			"descript" : "成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制成熟的消息收发确认机制",
			"url" : "http://udn.yyuap.com/doc/ae/920513.html",
			"_version_" : 1567172666823016448
		}, {
			"createTime" : "2017-05-12 11:15:51.0",
			"updateTime" : "2017-05-12 11:15:51.0",
			"id" : 16,
			"title" : "高稳定性高并发全平台社交聊天IM对外合作支持源码",
			"descript" : "成熟的消息收发确认机制，支持万人大群\n\n支持开发自定义的消息sdk接口，扩展性超强\n\n支持单/群聊，支持红包/文件等功能模块 支持朋友圈分享等功能\n\n同步增加商城/H5应用/附近的人/等模块化功能",
			"descriptImg" : "https://ss0.baidu.com/73F1bjeh1BF3odCf/it/u=1131968136,69861094&fm=85&s=33578A7E1E76C5DC54972FA80200B00A",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=146729",
			"_version_" : 1567172666827210752
		}, {
			"createTime" : "2017-05-12 11:17:47.0",
			"updateTime" : "2017-05-12 11:17:47.0",
			"id" : 17,
			"title" : "iUAP Mobile 移动开发工具（稳定版v2.5.1）下载",
			"descript" : "此文件较大，约688M，请使用web端下载，谢谢",
			"url" : "http://udn.yyuap.com/forum.php?mod=viewthread&tid=33279",
			"_version_" : 1567172666830356480
		}, {
			"createTime" : "2017-05-12 11:38:27.0",
			"updateTime" : "2017-05-12 11:38:27.0",
			"id" : 18,
			"title" : "DI常见问题",
			"descript" : "1.1.     作业 调度： 如何并行 执行 ？1.2.     表输出：如何 自动创建表 ？1.3.     作业 调度 ：如何 设置转换无效 ？",
			"url" : "http://udn.yyuap.com/doc/ae/919180.html",
			"_version_" : 1567172666832453632
		}]
	}